// Задача 41. Пользователь вводит с клавиатуры M чисел. Посчитайте, 
// сколько чисел больше 0 ввёл пользователь.
// задача для любого количества чисел


Console.WriteLine("Введите целые числа, разделённые запятой: ");
String arbitrary = Console.ReadLine();
Console.WriteLine(arbitrary);




